Tekla Open API Reference for Tekla Structures 2025
WpfFilterCheckBox Properties
The WpfFilterCheckBox type exposes the following members.
Properties
Name | Description
AttributeName
 Dialog attribute name defined with StructuresFieldAttribute
Top
See Also
Reference
WpfFilterCheckBox Class
Tekla.Structures.Dialog.UIControls Namespace